Updated diagram to use mermaid
